/*100人分のテストの点数を格納しているint配列型の変数pointsがあります。

この試験のヒストグラムを作成してください。

ヒストグラムは、階級ごとに個数を集計し、グラフ化したものです。

階級は、0点台（0〜9点）、10点台（10〜19点）、・・・90点台（90〜100点）とします。

（100点満点の人を90点台に含めているのがポイントです）


【実行結果】

ヒストグラム
 0点台 *
10点台 **
20点台 ******
30点台 **
40点台 **************
50点台 ****************
60点台 ****************************
70点台 *****************
80点台 **********
90点台 ****
 */


public class ForArrayNormalPractice {
    public static void main(String[] args) {
        // 100人分のテストの点数を格納した配列変数points
        int[] points = {
                          69, 40, 88, 68, 13, 62, 45, 43, 28, 69,
                          54, 77, 81, 34, 41, 78, 59, 21, 45, 64,
                          55, 18, 63, 80, 64, 26, 52, 44, 61, 50,
                          44, 82, 56, 74, 67, 98, 58, 84, 77, 70,
                          60, 77, 64, 89, 59, 74, 21, 66, 85, 68,
                          90, 48, 64, 80, 63, 47, 70, 79, 51, 66,
                          23, 84, 57, 57, 76, 60, 100, 66, 79, 61,
                          47, 66, 76, 45, 90, 69, 72, 51, 86, 64,
                          57, 51, 42, 60, 71, 69, 7, 62, 77, 61,
                          43, 50, 68, 30, 78, 58, 40, 62, 70, 22
                        };
        // ここからコーディングしてください
	int extent = 0;
	int i = 0;
    	System.out.print(" ");
	while (i < points.length) {
		if (i == 0)
			System.out.print(extent * 10 + "点台 ");
		if (10 * extent <= points[i] && points[i] < 10 * (extent+ 1))
			System.out.print("*");
		if (extent == 9 && points[i] == 100)
			System.out.print("*");	
		i++;
		
		if (extent != 9 && i == points.length - 1) {
			System.out.println();
			extent++;
			i = 0;
		}
	}
	System.out.println("\n");
    }
}






